Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/children_s_health/child_health_services.html.txt.tmx
Source language: en
Languages: ga

source: Children in Ireland are dependants of their parents and have the same entitlement to health services as their parents
ga: Cleithiúnaithe dá dtuismitheoirí is ea páistí agus tá siad i dteideal na seirbhísí sláinte céanna agus atá a dtuismitheoirí

source: This means that if your parents have a medical card, you are included as a dependant on that card and are entitled to the same range of services as your parents
ga: Ciallaíonn sin má tá cárta leighis ag do thuismitheoirí, go bhfuil tú áirithe mar chleithiúnaí ar an gcárta sin agus i dteideal an réimse céanna seirbhísí agus atá do thuismitheoirí

source: At the same time, there is a range of services specifically for children and certain services are provided free of charge for children even if their parents do not have a medical card
ga: Ag an am céanna tá réimse seirbhísí ar leith do pháistí agus cuirtear ar fáil seirbhísí áirithe saor in aisce do pháistí, fiú muna bhfuil cárta leighis ag a dtuismitheoirí

source: These services are generally provided as part of maternity and infant welfare services, health services for preschool children and school health services
ga: Go ginearálta cuirtear na seirbhísí seo ar fáil mar chuid de sheirbhísí leasa naíonán agus máithreachais, seirbhísí sláinte do pháistí réamhscoile agus seirbhísí sláinte scoile

source: Children are also entitled to vaccination and immunisation services free of charge
ga: Tá páistí freisin i dteideal seirbhísí vacsaínithe agus imdhíonta saor in aisce

source: The GP visit card for children under 6 is available to all children under the age of 6
ga: Tá fáil ar an gcárta cuairte LG ag leanaí faoi 6 bliana d’aois

source: For other children the GP visit card is means tested
ga: I dtaobh leanaí eile, déantar tástáil mhaoine ar an gcárta cuairte LG

source: Children may be treated in public or private hospitals on the same basis as adults
ga: Is féidir cóir leighis a chur ar pháistí in ospidéil phoiblí nó príobháideacha ar an mbunús céanna le daoine fásta

source: There are a number of specialist children's hospitals
ga: Tá líon ospidéil speisialtóirí ann do pháistí

source: Entitlement to hospital services is the same in these hospitals as in public and voluntary hospitals generally
ga: Go ginearálta is mar a chéile teidlíocht do sheirbhísí ospidéil sna hospidéil seo agus sna hospidéil phoiblí agus deonacha

source: These hospitals provide in-patient services, out-patient services, day care, accident and emergency services and specialist services for children
ga: Cuireann na hospidéil seo seirbhísí d'othair chónaitheacha, seirbhísí d'othair sheachtracha, cúram lae, seirbhísí timpiste agus éigeandála agus seirbhísí speisialtóra do pháistí ar fáil

source: If children are admitted to hospital for treatment of defects discovered at child and school health examinations, they do not have to pay the usual in-patient public hospital charges
ga: Má chuirtear páiste san ospidéal chun cóir leighis a chur ar éalanga a haimsíodh le linn scrúduithe sláinte leanaí scoile, ní gá dóibh na gnáth tháillí ospidéil d'othair chónaitheacha poiblí a íoc

source: Who is a child or young person?
ga: Céard is leanbh nó duine óg ann?

source: There is no one age at which a child ceases to be a child for the purposes of health services but 16 is the more usual cut-off point
ga: Níl aon aois faoi leith leagtha síos do pháistí le bheith incháilithe do sheirbhís sláinte, ach go hiondúil cuirtear críoch leis ag aois 16 bliain

source: Medical cards and young people over 16
ga: Cártaí leighis agus daoine óga ós cionn 16

source: If you are over 16 years of age and under 26 and you are a student or are financially dependent on your parents, you are entitled to medical card services if they possess a medical card
ga: Má tá tú os cionn 16 bliana d’aois agus faoi bhun 26 bliain agus más mac léinn thú nó má bhraitheann tú ar do thuismitheoirí ar mhaithe le cúrsaí airgeadais, tá tú i dteideal seirbhís cárta leighis a fháil má tá cárta leighis acu

source: In the medical card means test, there is an allowance for children aged over 16
ga: Sa tástáil mhaoine don chárta leighis, tá liúntas ann do leanaí os cionn 16 bliana

source: This allowance is increased if the child is in third-level education and is not getting a grant
ga: Méadaítear an liúntas seo má tá an leanbh in oideachas tríú leibhéal agus mura bhfuil deontas á fháil aige/aici

source: Children who are fostered all have individual medical cards
ga: Bíonn cártaí leighis dóibh féin ag páistí atá altramaithe

source: This is the case regardless of the entitlements of their foster parents
ga: Is é seo an cás, is cuma cén teidlíocht atá ag na tuismitheoirí altrama

source: Read more about fostering in Ireland here
ga: Tá tuilleadh eolais faoi altramú anseo

source: Prescribed drugs and medicines
ga: Drugaí agus Míochaine ar Oideas

source: Children may be regarded as dependants up to age 18 (or 23 if in full-time education) for the purposes of the Drugs Payment Scheme
ga: Féadtar caitheamh le leanaí mar chleithiúnaithe a fhad le haois 18 mbliana (nó 23, má tá siad in oideachas lán-aimseartha) ar mhaithe le cuspóirí na Scéime Íocaíochta Drugaí

source: Children of any age who are mentally or physically disabled to such an extent that it is not reasonably possible for them to maintain themselves fully and who are living at home may also be regarded as dependants for the prescribed drugs and medicines arrangements
ga: Breathnaítear ar pháistí d'aon aois a bhfuil míchumas coirp nó meabhrach orthu, go dtí an pointe nach bhfuil siad in ann aire cheart a thabhairt dóibh féin agus atá ina gcónaí sa bhaile, mar chleithiúnaithe, i gcomhair na socruithe drugaí agus míochaine ar oideas

source: Consent to medical treatment
ga: Toiliú do chóir leighis

source: In general, children over the age of 16 may themselves give consent to surgical procedures
ga: Go ginearálta is féidir le páistí ós cionn 16, cinneadh a dhéanamh iad féin faoi mhodhanna máinliachta

source: It is the practice to get parental consent to medical procedures for children under that age even though it is not entirely clear that parents have the ultimate decision
ga: Is é an cleachtadh ná toiliú tuistí a fháil i gcomhair modhanna leighis do pháistí faoin aois sin, cé nach bhfuil sé ró-shoiléir go bhfuil an cinneadh deireadh ag na tuismitheoirí

source: In a recent court case, the Supreme Court ruled that only in exceptional circumstances would the court intervene to make an order that was contrary to the decision of parents regarding procedures for their children
ga: I gcás cúirte le gairid, rialaigh an Chúirt Uachtarach gur i gcúrsaí eisceachtúla amháin a dhéanadh an chúirt idirghabháil, chun ordú a dhéanamh a bheadh contrártha do chinneadh na dtuismitheoirí faoi mhodhanna leighis a bpáistí

source: So, in general, parental consent is required for children to have medical and surgical tests and procedures and to receive vaccinations and inoculations
ga: Mar sin, go ginearálta teastaíonn toiliú tuistí ó pháistí chun dul faoi scrúduithe agus modhanna máinliachta agus leighis, chun vacsaín agus ionaclú a fháil

source: Read more about consent to medical and surgical procedures here
ga: Léigh tuilleadh eolais faoi toiliú don chóireáil leighis agus máinliach

source: The law on the provision of health services to children in Ireland
ga: An dlí maidir le soláthar seirbhísí sláinte do leanaí in Éirinn

source: The Health Act 1970 is the principal legislation providing for children's health services in Ireland
ga: Is é Acht Sláinte 1970 an phríomh-reachtaíocht a dhéanann foráil i gcomhair seirbhísí sláinte leanaí

source: Section 66 of Health Act 1970 provides that the Health Service Executive (HSE) is obliged to make available free of charge at clinics, health centres or other places a health examination and treatment service for children aged under 6 and for pupils attending national schools
ga: Déanann Alt 66 den Acht Sláinte 1970 foráil go bhfuil oibleagáid ar Fheidhmeannacht na Seirbhíse Sláinte seirbhís scrúdaithe agus cóireála sláinte a chur ar fáil saor in aisce do leanaí faoi bhun 6 bliana d’aois agus do dhaltaí atá ag freastal ar bhunscoileanna, ag clinicí, ionaid sláinte nó in áiteanna eile

source: Section 66 of that Act also allows for other schools to request the service and the HSE has the discretion to extend the service to such schools
ga: Ceadaíonn Alt 66 den Acht sin do scoileanna eile an tseirbhís a iarraidh, agus tá sé de lánrogha ag FSS an tseirbhís a shíneadh chuig scoileanna den sórt sin

source: The legislation does not specify precisely what services are to be provided
ga: Ní shonraítear go beacht sa reachtaíocht cé acu seirbhísí atá le cur ar fáil

source: In practice, the services include immunisation services, developmental paediatric examinations, visits by public health nurses, child welfare clinics and school health examinations
ga: De ghnáth, cuimsíonn na seirbhísí seo seirbhísí imdhíonta, scrúduithe forbraíochta péidiatraiceacha, cuairteanna ó altraí sláinte poiblí, clinicí leasa leanaí agus scrúduithe sláinte scoile

source: Section 67 of the Health Act 1970 provides that the HSE must provide dental, ophthalmic and aural treatment and appliances in respect of defects discovered at school health examinations set out under Section 66 of the same Act
ga: Déanann Alt 67 den Acht Sláinte 1970 foráil nach mór don FSS fearas agus cóireáil fiaclóireachta, oftalmacha agus cluas a chur ar fáil i leith máchailí a fuarthas ag scrúduithe sláinte scoile arna leagan síos faoi Alt 66 den Acht sin

source: The Health (Amendment) Act 1994 provides that the HSE must provide free dental services for children who have attended schools to which Section 66 applied and who are below a certain age
ga: Déanann an tAcht Sláinte (Leasú) 1994 foráil nach mór don FSS seirbhísí fiaclóireachta saor in aisce a chur ar fáil do leanaí a d’fhreastail ar scoileanna lena mbaineann Alt 66 agus atá faoi aois áirithe

source: SI 334/2009 Health (Dental Services for Children) Regulations 2009 sets the age limit as being up to the 16th birthday and provides that the children in question get a preventive dental treatment service in addition to a dental health screening service and primary care treatment in respect of defects discovered
ga: Socraíonn IR 334/2009 Rialacháin Sláinte (Seirbhísí Fiaclóireachta do Leanaí) 2009 an teorainn aoise ag 15 bliana d’aois agus déanann sé foráil nach mór do na leanaí atá i gceist seirbhís cóireála fiaclóireachta coisctheach a fháil chomh maith le seirbhís scagthástála agus cóireáil príomhchúram sláinte fiacla maidir le máchail a fhaightear
